<template>
  <div class="container">
    <div class="path">
      首頁/常見問題
    </div>
    <div
      v-for="question in questions"
      :key="question.index"
      class="question d-flex flex-column justify-content-start align-items-start"
    >
      <input
        :id="`toggle${question.id}`"
        type="checkbox"
        class="toggle"
      >
      <div class="d-flex justify-content-between w-100">
        <label
          class="title"
          :for="`toggle${question.id}`"
        >
          {{ question.title }}
        </label>
        <label
          class="checkMark"
          :for="`toggle${question.id}`"
        > &lt; </label>
      </div>
      <div class="horizon w-100" />
      <div class="content">
        {{ question.content }}
      </div>
    </div>
    <!-- <button @click="toggleFeatures">bbbbbutton</button> -->
  </div>
</template>

<script>
const dummyData = {
  questions: [
    {
      id: '1',
      title: '如何成為租借可租借身份？',
      content: '說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字'
    },
    {
      id: '2',
      title: '如何成為租借可租借身份？',
      content: '說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字'
    },
    {
      id: '3',
      title: '如何成為租借可租借身份？',
      content: '說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字'
    },
    {
      id: '4',
      title: '如何成為租借可租借身份？',
      content: '說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字'
    },
    {
      id: '5',
      title: '如何成為租借可租借身份？',
      content: '說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字'
    },
    {
      id: '6',
      title: '如何成為租借可租借身份？',
      content: '說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字'
    },
    {
      id: '7',
      title: '如何成為租借可租借身份？',
      content: '說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字'
    },
    {
      id: '8',
      title: '如何成為租借可租借身份？',
      content: '說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字說明文字'
    }
  ]
}
export default {
  data () {
    return {
      questions: [],
      featuresOpen: false
    }
  },
  created () {
    this.fetchQuestions()
  },
  methods: {
    fetchQuestions () {
      const { questions } = dummyData
      this.questions = questions
    },
    toggleFeatures () {
      this.featuresOpen = !this.featuresOpen
    }
  }
}
</script>

<style lang="scss" scoped>
@import "../assets/scss/_base.scss";
@import "../assets/scss/reset.scss";
.container {
  padding: 26px 120px;
  width: 100%;
  height: 100%;
}
.path {
  text-align: left;
  @include font-setting('Noto Serif TC', normal, 700, 16px, 23px, #9AA0A9);
}
.question {
  margin-top: 28px;
}
.title {
  width: auto;
  height: 20px;
  display: block;
  @include font-setting('Noto Serif TC', normal, 700, 24px, 20px, #3B485B);
}
.horizon {
  margin-top: 16px;
  height: 0.5px;
  border: 0.5px solid #D1D5DB;
  background-color: #D1D5DB;
  // transform: scale(1, 0);
}
.content {
  opacity: 0;
  height: 0;
  // transform: scale(1, 0);
  // transform: translate(-50%, -50%);
  text-align: left;
  transition: all 0.5s ease-out;
  @include font-setting('Noto Serif TC', normal, 400, 16px, 32px, #6B7280);
}
.toggle {
  position: absolute;
  top: 0;
  display: none;
  & ~ div > label {
    transition: all 0.7s ease-out;
    cursor: pointer;
  }
  &:checked ~ .content {
    // transition: opacity 0.2s ease-out 0.1s;
    height: 100%;
    opacity: 1;
    // transform: scale(1, 1);
    // transform-origin: top;
  }
  &:checked ~ div > .checkMark {
    transform: rotate(-0.25turn);
  }
}
</style>
